
/* memory width template */
"%u data bits, %u ECC bits" = "%u data bits, %u ECC bits";

/* 12-way associativity */
"12-way Set-Associative" = "12-way Set-Associative";

/* bus width */
"128 bit" = "128 bit";

/* bus width */
"12x or x12" = "12x or x12";

/* bus width */
"16 bit" = "16 bit";

/* 16-way associativity */
"16-way Set-Associative" = "16-way Set-Associative";

/* bus width */
"16x or x16" = "16x or x16";

/* bus width */
"1x or x1" = "1x or x1";

/* 2-way associativity */
"2-way Set-Associative" = "2-way Set-Associative";

/* 20-way associativity */
"20-way Set-Associative" = "20-way Set-Associative";

/* 24-way associativity */
"24-way Set-Associative" = "24-way Set-Associative";

/* connector type */
"25 Pin Dual Inline (pin 26 cut)" = "25 Pin Dual Inline (pin 26 cut)";

/* bus width */
"2x or x2" = "2x or x2";

/* bus width */
"32 bit" = "32 bit";

/* 32-way associativity */
"32-way Set-Associative" = "32-way Set-Associative";

/* bus width */
"32x or x32" = "32x or x32";

/* memory type */
"3DRAM" = "3DRAM";

/* 4-way associativity */
"4-way Set-Associative" = "4-way Set-Associative";

/* 48-way associativity */
"48-way Set-Associative" = "48-way Set-Associative";

/* bus width */
"4x or x4" = "4x or x4";

/* connector type */
"50 Pin Dual Inline" = "50 Pin Dual Inline";

/* connector type */
"50 Pin MiniSCSI" = "50 Pin MiniSCSI";

/* bus width */
"64 bit" = "64 bit";

/* 64-way associativity */
"64-way Set-Associative" = "64-way Set-Associative";

/* connector type */
"68 Pin Dual Inline" = "68 Pin Dual Inline";

/* bus width */
"8 bit" = "8 bit";

/* 8-way associativity */
"8-way Set-Associative" = "8-way Set-Associative";

/* port type */
"8251 Compatible" = "8251 Compatible";

/* port type */
"8251 FIFO Compatible" = "8251 FIFO Compatible";

/* bus width */
"8x or x8" = "8x or x8";

/* connector type */
"9 Pin Dual Inline (pin 10 cut)" = "9 Pin Dual Inline (pin 10 cut)";

/* slot type */
"AGP" = "AGP";

/* slot type */
"AGP2X" = "AGP2X";

/* slot type */
"AGP4X" = "AGP4X";

/* slot type */
"AGP8X" = "AGP8X";

/* connector type */
"Access Bus (USB)" = "Access Bus (USB)";

/* port type */
"Access Bus Port" = "Access Bus Port";

/* asynchronous SRAM type */
"Asynchronous" = "Asynchronous";

/* port type */
"Audio Port" = "Audio Port";

/* connector type */
"BNC" = "BNC";

/* burst SRAM type */
"Burst" = "Burst";

/* memory type */
"CDRAM" = "CDRAM";

/* cache header template */
"Cache Unit %d" = "Cache Unit %d";

/* port type */
"Cardbus" = "Cardbus";

/* connector type */
"Centronics" = "Centronics";

/* memory form factor */
"Chip" = "Chip";

/* connector type */
"Circular DIN-8 female" = "Circular DIN-8 female";

/* connector type */
"Circular DIN-8 male" = "Circular DIN-8 male";

/* connector type */
"DB-15 pin female" = "DB-15 pin female";

/* connector type */
"DB-15 pin male" = "DB-15 pin male";

/* connector type */
"DB-25 pin female" = "DB-25 pin female";

/* connector type */
"DB-25 pin male" = "DB-25 pin male";

/* connector type */
"DB-9 pin female" = "DB-9 pin female";

/* connector type */
"DB-9 pin male" = "DB-9 pin male";

/* memory type */
"DDR" = "DDR";

/* memory type */
"DDR2" = "DDR2";

/* memory type */
"DDR2 FB-DIMM" = "DDR2 FB-DIMM";

/* memory type */
"DDR3" = "DDR3";

/* memory form factor */
"DIMM" = "DIMM";

/* memory form factor */
"DIP" = "DIP";

/* memory type */
"DRAM" = "DRAM";

/* data cache type */
"Data" = "Data";

/* direct mapped associativity */
"Direct Mapped" = "Direct Mapped";

/* memory type */
"EDRAM" = "EDRAM";

/* memory type */
"EEPROM" = "EEPROM";

/* slot type */
"EISA" = "EISA";

/* memory type */
"EPROM" = "EPROM";

/* unpopulated memory socket */
"Empty Socket" = "Empty Socket";

/* device type */
"Ethernet" = "Ethernet";

/* memory form factor */
"FB-DIMM" = "FB-DIMM";

/* memory type */
"FBD2" = "FBD2";

/* memory type */
"FEPROM" = "FEPROM";

/* port type */
"FireWire (IEEE P1394)" = "FireWire (IEEE P1394)";

/* memory type */
"Flash" = "Flash";

/* full associativity */
"Fully Associative" = "Fully Associative";

/* connector type */
"HP-HIL" = "HP-HIL";

/* slot type */
"I/O Riser Card Slot" = "I/O Riser Card Slot";

/* connector type */
"IEEE 1394" = "IEEE 1394";

/* slot type */
"ISA" = "ISA";

/* connector type */
"Infrared" = "Infrared";

/* instruction cache type */
"Instruction" = "Instruction";

/* port type */
"Joystick Port" = "Joystick Port";

/* port type */
"Keyboard Port" = "Keyboard Port";

/* slot length */
"Long" = "Long";

/* slot type */
"MCA" = "MCA";

/* port type */
"MIDI Port" = "MIDI Port";

/* memory device header template */
"Memory Unit %d" = "Memory Unit %d";

/* connector type */
"Micro-DIN" = "Micro-DIN";

/* connector type */
"Mini Centronics" = "Mini Centronics";

/* connector type */
"Mini-Centronics Type 14" = "Mini-Centronics Type 14";

/* connector type */
"Mini-Centronics Type 26" = "Mini-Centronics Type 26";

/* connector type */
"Mini-DIN" = "Mini-DIN";

/* connector type */
"Mini-jack (headphones)" = "Mini-jack (headphones)";

/* port type */
"Modem Port" = "Modem Port";

/* port type */
"Mouse Port" = "Mouse Port";

/* multi bit ECC type */
"Multi-bit ECC" = "Multi-bit ECC";

/* port type */
"Network Port" = "Network Port";

/* no connector specification */
"No connector" = "No connector";

/* non-burst SRAM type */
"Non-Burst" = "Non-Burst";

/* no ECC available
   port type */
"None" = "None";

/* slot type */
"NuBus" = "NuBus";

/* connector type */
"On Board Floppy" = "On Board Floppy";

/* connector type */
"On Board IDE" = "On Board IDE";

/* connector type */
"On Board Sound Input from Optical Drive" = "On Board Sound Input from Optical Drive";

/* other SRAM type
   generic 'other' specification */
"Other" = "Other";

/* connector type */
"Other Connector" = "Other Connector";

/* port type */
"Other Port" = "Other Port";

/* device type */
"PATA Interface" = "PATA Interface";

/* slot type */
"PC Card" = "PC Card";

/* port type */
"PC Card Type I" = "PC Card Type I";

/* port type */
"PC Card Type II" = "PC Card Type II";

/* port type */
"PC Card Type III" = "PC Card Type III";

/* connector type
   port type */
"PC-98" = "PC-98";

/* connector type */
"PC-98 Full" = "PC-98 Full";

/* connector type */
"PC-98 Hireso" = "PC-98 Hireso";

/* connector type */
"PC-98 Note" = "PC-98 Note";

/* port type */
"PC-98-Hireso" = "PC-98-Hireso";

/* slot type */
"PC-98/C20" = "PC-98/C20";

/* slot type */
"PC-98/C24" = "PC-98/C24";

/* slot type */
"PC-98/Card" = "PC-98/Card";

/* slot type */
"PC-98/E" = "PC-98/E";

/* slot type */
"PC-98/Local Bus" = "PC-98/Local Bus";

/* connector type
   port type */
"PC-H98" = "PC-H98";

/* slot type */
"PCI" = "PCI";

/* slot type */
"PCI - 66 MHz Capable" = "PCI - 66 MHz Capable";

/* slot type */
"PCI Express" = "PCI Express";

/* slot type */
"PCI Express Gen 2" = "PCI Express Gen 2";

/* slot type */
"PCI Express Gen 2 x1" = "PCI Express Gen 2 x1";

/* slot type */
"PCI Express Gen 2 x16" = "PCI Express Gen 2 x16";

/* slot type */
"PCI Express Gen 2 x2" = "PCI Express Gen 2 x2";

/* slot type */
"PCI Express Gen 2 x4" = "PCI Express Gen 2 x4";

/* slot type */
"PCI Express Gen 2 x8" = "PCI Express Gen 2 x8";

/* slot type */
"PCI Express Gen 3" = "PCI Express Gen 3";

/* slot type */
"PCI Express Gen 3 x1" = "PCI Express Gen 3 x1";

/* slot type */
"PCI Express Gen 3 x16" = "PCI Express Gen 3 x16";

/* slot type */
"PCI Express Gen 3 x2" = "PCI Express Gen 3 x2";

/* slot type */
"PCI Express Gen 3 x4" = "PCI Express Gen 3 x4";

/* slot type */
"PCI Express Gen 3 x8" = "PCI Express Gen 3 x8";

/* slot type */
"PCI Express x1" = "PCI Express x1";

/* slot type */
"PCI Express x16" = "PCI Express x16";

/* slot type */
"PCI Express x2" = "PCI Express x2";

/* slot type */
"PCI Express x4" = "PCI Express x4";

/* slot type */
"PCI Express x8" = "PCI Express x8";

/* slot type */
"PCI-X" = "PCI-X";

/* connector type */
"PS/2" = "PS/2";

/* port type */
"Parallel Port ECP" = "Parallel Port ECP";

/* port type */
"Parallel Port ECP/EPP" = "Parallel Port ECP/EPP";

/* port type */
"Parallel Port EPP" = "Parallel Port EPP";

/* port type */
"Parallel Port PS/2" = "Parallel Port PS/2";

/* port type */
"Parallel Port XT/AT Compatible" = "Parallel Port XT/AT Compatible";

/* ECC type parity */
"Parity" = "Parity";

/* pipeline burst SRAM type */
"Pipeline Burst" = "Pipeline Burst";

/* processor header template */
"Processor %d" = "Processor %d";

/* slot type */
"Processor Card Slot" = "Processor Card Slot";

/* memory form factor
   slot type */
"Proprietary" = "Proprietary";

/* slot type */
"Proprietary Memory Card Slot" = "Proprietary Memory Card Slot";

/* connector type */
"Proprietary connector" = "Proprietary connector";

/* memory type */
"RAM" = "RAM";

/* memory type */
"RDRAM" = "RDRAM";

/* memory form factor */
"RIMM" = "RIMM";

/* connector type */
"RJ-11" = "RJ-11";

/* connector type */
"RJ-45" = "RJ-45";

/* memory type */
"ROM" = "ROM";

/* memory form factor */
"Row of chips" = "Row of chips";

/* port type */
"SAS" = "SAS";

/* device type */
"SAS Interface" = "SAS Interface";

/* connector type */
"SAS/SATA plug receptacle" = "SAS/SATA plug receptacle";

/* port type */
"SATA" = "SATA";

/* device type */
"SATA Interface" = "SATA Interface";

/* device type */
"SCSI Host Adapter" = "SCSI Host Adapter";

/* port type */
"SCSI II" = "SCSI II";

/* port type */
"SCSI Port" = "SCSI Port";

/* port type */
"SCSI Wide" = "SCSI Wide";

/* memory type */
"SDRAM" = "SDRAM";

/* memory type */
"SGRAM" = "SGRAM";

/* memory form factor */
"SIMM" = "SIMM";

/* memory form factor */
"SIP" = "SIP";

/* memory form factor */
"SODIMM" = "SODIMM";

/* memory type */
"SRAM" = "SRAM";

/* memory form factor */
"SRIMM" = "SRIMM";

/* connector type
   port type */
"SSA SCSI" = "SSA SCSI";

/* port type */
"Serial Port 16450 Compatible" = "Serial Port 16450 Compatible";

/* port type */
"Serial Port 16550 Compatible" = "Serial Port 16550 Compatible";

/* port type */
"Serial Port 16550A Compatible" = "Serial Port 16550A Compatible";

/* port type */
"Serial Port XT/AT Compatible" = "Serial Port XT/AT Compatible";

/* slot length */
"Short" = "Short";

/* single bit ECC type */
"Single-bit ECC" = "Single-bit ECC";

/* device type */
"Sound" = "Sound";

/* synchronous SRAM type */
"Synchronous" = "Synchronous";

/* memory form factor */
"TSOP" = "TSOP";

/* device type */
"Token Ring" = "Token Ring";

/* port type */
"USB" = "USB";

/* unified cache type */
"Unified" = "Unified";

/* generic 'other' specification */
"Unknown" = "Unknown";

/* general unspecified count */
"Unspecified" = "Unspecified";

/* slot type */
"VL-VESA" = "VL-VESA";

/* memory type */
"VRAM" = "VRAM";

/* device type */
"Video" = "Video";

/* port type */
"Video Port" = "Video Port";

/* memory form factor */
"ZIP" = "ZIP";
